{
  "job_id": "57733",
  "title": "Cloud Engineer (m/w/d)",
  "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBWI Stellenanzeige\n\n\nSTELLEN-ID: 57733\n\nCloud Engineer (m/w/d)\n\nab sofort und in Vollzeit bundesweit an einem unserer BWI-Standorte.\n\nSorgen Sie gemeinsam mit uns für die digitale Zukunftsfähigkeit der Bundeswehr.\n\nAls primärer Digitalisierungspartner der Bundeswehr erbringen wir stabile, sichere und effiziente IT-Services im In- und Ausland,\n\nvom Grundbetrieb bis in den einsatznahen Bereich und tragen so zur kontinuierlichen Erhöhung der Führungs- und Einsatzfähigkeit\n\nder Bundeswehr bei. Mit über 7.000 Kolleg*innen betreiben und modernisieren wir eine der größten und komplexesten IT-\n\nInfrastrukturen in Deutschland. Wir suchen verantwortungsvolle IT-Spezialist*innen, die die Bundeswehr-IT aus Überzeugung in\n\nherausfordernden Digitalisierungsvorhaben weiterentwickeln und so einen Beitrag zur Sicherheit Deutschlands leisten wollen. \n\nDer Bereich Shared Service Delivery (SSD) ist für das Servicedesign, die Serviceentwicklung und die Bereitstellung aller End-User-,\n\nRechenzentren & Cloud-Infrastrukturen sowie Communication Services des BWI-Service-Portfolios verantwortlich. Er stellt\n\nüberwiegend standardisierte Servicelösungen für Kunden zur Verfügung. Die SSD ist integraler Bestandteil der CDO und somit\n\nmaßgeblich verantwortlich für die gemeinsamen Ziele und Maßnahmen. Unser Ansporn ist maximale Betriebsstabilität und hohe\n\nKundenzufriedenheit.\n\nDie Abteilungen SSD PoD2 C&P Cloud Team 1 und Cloud Team 2 sind für die Architektur, Entwicklung und Bereitstellung der\n\nprivaten Cloud für den Kunden verantwortlich und stellen standardisierte Serviceleistungen zur Verfügung.\n\nIhre Aufgaben:\n\nEntwicklung und Betrieb skalierender Cloud-nativer Services auf Kubernetes zur Nutzung in einem privaten Cloud Umfeld•\nErstellung und Bereitstellung von Containern•\nFachliche Beratung in Cloud Entwicklungsprojekten•\n\nIhr Profil:\n\nAbgeschlossenes fachbezogenes Hochschulstudium im IT-Umfeld oder vergleichbar•\nMindestens 5 Jahre einschlägige Berufserfahrung•\n\n\n\nSehr gute Erfahrung in der Bereitstellung in CI/CD-Pipelines in deklarativen Deployments mit Git und Helm Charts•\nErfahrung im IoT Bereich und mit Message Brokern, sowie in Automatisierung, Skripting und Programmierung bzw.\n\nSoftwareentwicklung\n•\n\nErfahrungen mit Kafka und idealerweise MQTT sowie im Cloud-nativen Monitoring und Logging•\nKenntnisse und Erfahrungen in ITIL, agilen Methoden (Scrum, Kanban etc.) und im DevSecOps-Umfeld•\nReisebereitschaft•\nVerhandlungssichere Deutsch- und Englischkenntnisse in Wort und Schrift•\n\nWir bieten:\n\nDie BWI bietet eine marktgerechte Vergütung, einen sicheren Arbeitsplatz sowie eine prämierte und arbeitgeberfinanzierte\n\nbetriebliche Altersvorsorge\n•\n\nSie starten grundsätzlich mit 30 Tagen Jahresurlaub mit Option auf individuelle Anpassungen•\nWir ermöglichen Ihnen Flexibilität, um Beruf und Privatleben in Einklang zu bringen•\nWir unterstützen Ihre berufliche und persönliche Weiterbildung durch individuelle Maßnahmen sowie einen kostenfreien Zugriff\n\nauf LinkedIn Learning und die Angebote der BWI-Academy\n•\n\nMobiles Arbeiten ist möglich, alternativ kann alternierende oder heimbasierte Telearbeit mit Ausstattung des Heimarbeitsplatzes\n\nbeantragt werden\n•\n\nSie können ihr Wunschfahrrad leasen und über eine Bruttogehaltsumwandlung vergünstigt abrechnen•\n\nFragen?\n\nNehmen Sie Kontakt mit unserem Recruitingteam auf.\n\nKristin Reichmann\n\nRecruiterin\n\nSchreiben Sie uns unter bewerbung@bwi.de oder rufen Sie an +49 (0)2225 988 5000.\n\nmailto:bewerbung@bwi.de\ntel:+49022259885000\n\n",
  "file": "cloud-engineer-m-w-d-57733.pdf",
  "skills": {
    "Job Title": " Cloud Data Engineer",
    "IT Skills": "Data modeling, Data architecture design, Cloud database administration, AWS services (RDS, Dynamo DB, S3, AWS DMS, Kinesis), Attunity Replicate support, SQL development, Database troubleshooting, Database management procedures, Database replication, Database monitoring and optimization, Backup and recovery, UNIX Shell Scripting",
    "Soft Skills": "Analytical thinking, Conceptual thinking, Design skills, Problem-solving skills, Communication skills, Mentoring skills, Team collaboration, Adaptability to work in 24x7 operations, Continuous improvement mindset"
  }
}
