{
  "applicant_id": 1,
  "job_id": 1,
  "challenge": "Deine Scrum Master Challenge\nWir haben uns drei verschiedene Szenarien überlegt und möchten Dich bitten, diese zu bearbeiten.\nWie Du dabei vorgehst, ist ganz Dir überlassen. Gerne kannst Du Deine Ausarbeitungen auch visuell darstellen. Dies ist aber kein Muss. Plane bitte für jeden Fall ca. 20 Minuten, inklusive Fragen, ein.\nFall 1\nEine klassische Retrospektive wird im Team regelmäßig durchgeführt. Ein Post Mortem allerdings nur bei Bedarf. Bitte gehe auf folgende Fragen näher ein:\n• Was ist der Unterschied zwischen einer Retro und einem Post Mortem?\n• Wann und warum wird ein Post Mortem hauptsächlich durchgeführt?\n• Nenne das Ziel eines Post Mortems und gehe darauf ein, was muss alles beachtet werden sollte.\nFall 2\nDu bist Scrum Master in einem Unternehmen, das sich in einer agilen Transformation befindet, die top down durchgesetzt wurde. Viele Entwickler freuen sich über die Veränderung, allerdings ist die Freude im mittleren Management eher gering. Hier fürchtet man um seinen Job und den damit verbundenen Machtverlust.\nDein Vorgesetzter hat eigene Vorstellungen vom agilen Arbeiten und bittet Dich darum, Leistungskennzahlen für jedes Teammitglied zu erstellen. Für den Chef ist außerdem klar, dass die Leistung der Entwickler abhängig von den erledigten Story Points im Sprint ist und Schätzungen sieht er grundsätzlich als verbindliche Zusage an. Zur Krönung fordert er Dich auf, Deinen eigenen Wert anhand einer Metrik zu belegen.\nDie Teammitglieder kommen auf Dich zu und bitten Dich um Hilfe. Du suchst das Gespräch mit Deinem Chef.\n• Wie gehst Du dabei vor?\nFall 3\nDer Produkt Owner aus Deinem Team ist noch relativ unerfahren in seiner Rolle. Ihm ist der Nutzen des Produktes nicht ganz klar. Auch die Teammitglieder können ihm nur oberflächlich weiterhelfen.\nEr möchte nun gerne mit dem Team eine gemeinsame Produktvision erstellen und bittet Dich um Hilfe bei der Durchführung eines Workshops.\n• Welche Methoden zur Erstellung einer Produktvision kennst Du und welche würdest Du anwenden? Bitte begründe Deine Wahl."
}