{
  "applicant_id": 1,
  "job_id": 1,
  "solution": "In einer klassischen Retrospektive reflektiert das Team regelmäßig über den zurückliegenden Sprint, identifiziert Verbesserungspotenziale und feiert Erfolge. Sie ist ein fest eingeplantes Meeting innerhalb eines jeden Sprints. Ein Post Mortem hingegen wird bei Bedarf nach einem spezifischen Ereignis oder Projektende durchgeführt, insbesondere wenn etwas schiefgelaufen ist. Hauptsächlich wird ein Post Mortem durchgeführt, um aus Fehlern zu lernen, die Ursachen zu analysieren und Maßnahmen zu definieren, um zukünftige Probleme zu vermeiden. Das Ziel eines Post Mortems ist es, Transparenz zu schaffen und kontinuierlich zu verbessern. Dabei sollte auf eine offene Kommunikation, objektive Analyse und die Nachverfolgung der festgelegten Maßnahmen geachtet werden.\n Als Scrum Master in einem Unternehmen, das sich top-down agil transformiert, ist es essenziell, die Bedenken und Ängste des mittleren Managements zu verstehen und ernst zu nehmen. Dein Ansatz sollte darauf abzielen, Vertrauen aufzubauen und die Vorteile der agilen Arbeitsweise klar zu kommunizieren. In Bezug auf die Aufforderung deines Chefs, Leistungskennzahlen für jedes Teammitglied zu erstellen, ist es wichtig, darauf hinzuweisen, dass agile Prinzipien auf Teamleistung und Zusammenarbeit abzielen, anstatt auf individuelle Leistungen. Story Points sollten als flexible Schätzungen betrachtet und nicht als verbindliche Zusagen angesehen werden. Dein Gespräch mit dem Chef sollte empathisch, aber bestimmt sein. Erkläre, wie wichtig es ist, eine Kultur des Vertrauens zu schaffen und dass das Team als Ganzes erfolgreich sein muss, um das volle Potenzial agiler Methoden auszuschöpfen. Es wäre hilfreich, erfolgreiche Beispiele aus anderen Unternehmen oder Projekten vorzubringen, um deine Argumentation zu unterstützen. Zudem solltest du diplomatisch auf die Problematik hinweisen, deinen eigenen Wert anhand einer Metrik zu belegen, da deine Rolle als Scrum Master mehr auf die Unterstützung und Förderung des Teams ausgerichtet ist und weniger auf messbare individuelle Leistungen. \n In einem Workshop zur Erstellung einer Produktvision ist es essenziell, dass alle Teammitglieder und der Produkt Owner ein gemeinsames Verständnis für das Ziel und den Nutzen des Produktes entwickeln. Eine bewährte Methode ist beispielsweise die Vision-Box-Technik, bei der das Team eine fiktive Verpackung für das Produkt entwirft, um den Nutzen und die Features zu visualisieren. Eine weitere Methode ist das Elevator Pitch Statement, bei dem das Team eine kurze und prägnante Aussage formuliert, die den Kern des Produkts und seinen Nutzen in wenigen Sätzen beschreibt. Diese Methoden fördern Kreativität und ein gemeinsames Verständnis. Ich würde die Vision-Box-Technik empfehlen, weil sie visuell und kollaborativ ist, was besonders hilfreich ist, wenn der Nutzen des Produktes noch nicht klar definiert ist. Sie ermöglicht es dem Produkt Owner und dem Team, konkrete Vorstellungen und Erwartungen zu formulieren, die dann als Basis für die weitere Produktentwicklung dienen."
}