{
  "applicant_id": 1,
  "job_id": 1,
  "Technische Fragen": [
    {
      "Frage": "Was ist der Unterschied zwischen Scrum und Kanban?",
      "Bewertung": "Die Antwort sollte die Unterschiede in der Struktur, wie feste Sprints in Scrum und kontinuierlichen Fluss in Kanban, sowie die Rollen und Werkzeuge klar erläutern."
    },
    {
      "Frage": "Wie würden Sie einem Team helfen, das mit der Velocity-Reduktion kämpft?",
      "Bewertung": "Die Antwort sollte auf eine Analyse der Hindernisse, Retrospektiven und praktische Ansätze wie Story-Splitting oder die Beseitigung von Bottlenecks eingehen."
    },
    {
      "Frage": "Wie misst man den Erfolg eines Sprints?",
      "Bewertung": "Die Antwort sollte die Erreichung der Sprintziele, Qualität der gelieferten Inkremente, Feedback aus Retrospektiven und Stakeholder-Zufriedenheit behandeln."
    },
    {
      "Frage": "Welche Metriken sind hilfreich, um die Effizienz eines Scrum-Teams zu bewerten?",
      "Bewertung": "Die Antwort sollte Metriken wie Velocity, Burndown-Charts, Lead Time und Cycle Time erklären und deren Bedeutung für die Bewertung der Team-Effizienz beschreiben."
    }
  ],
  "Persönliche Eignung": [
    {
      "Frage": "Wie würden Sie sicherstellen, dass ein Team selbstorganisiert arbeitet?",
      "Bewertung": "Die Antwort sollte zeigen, wie der Bewerber klare Ziele setzt, Coaching anbietet und die Teammitglieder ermutigt, Verantwortung zu übernehmen."
    },
    {
      "Frage": "Wie gehen Sie mit einem Konflikt zwischen Teammitgliedern um?",
      "Bewertung": "Die Antwort sollte Strategien wie offene Kommunikation, das Verständnis beider Perspektiven und die Unterstützung bei der Lösungsfindung beschreiben."
    },
    {
      "Frage": "Beschreiben Sie Ihre Erfahrungen mit der Einführung von Scrum in einem neuen Team.",
      "Bewertung": "Die Antwort sollte zeigen, wie der Bewerber Scrum-Workshops organisiert, Grundlagen vermittelt und das Team beim Übergang unterstützt hat."
    },
    {
      "Frage": "Wie würden Sie ein Team motivieren, das unter starkem Druck steht?",
      "Bewertung": "Die Antwort sollte darauf eingehen, wie Arbeitslast fair verteilt wird, Prioritäten gesetzt werden und Erfolge hervorgehoben werden, um die Moral zu stärken."
    }
  ],
  "Codingaufgabe": [
    {
      "Aufgabe": "Erstellen Sie ein Tool, das Scrum-Retrospektiven erleichtert.",
      "Bewertung": "Die Lösung sollte eine benutzerfreundliche Oberfläche bieten, Funktionen zur Eingabe von Feedback, Priorisierung und Berichtserstellung umfassen und mit Technologien wie React und Node.js umgesetzt werden."
    }
  ],
  "Zusammenfassung": "Der Bewerber sollte ein fundiertes Verständnis der Prinzipien und Praktiken von Scrum zeigen. Die Antworten auf technische und persönliche Fragen sowie die Codingaufgabe sollten die Fähigkeit zur Kommunikation, Problemlösung und praktischen Umsetzung belegen.",
  "Empfehlung": "Die Antworten und die Umsetzung der Codingaufgabe sollten die Eignung des Bewerbers für die Rolle als Scrum/Agile Coach bestätigen, indem sie ein starkes Verständnis agiler Praktiken und Werkzeuge zeigen."
}
