{"job_id": "58350", "title": "Frontend Developer (Web, App, Flutter) (w/m/d)", "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBWI Stellenanzeige\n\n\nSTELLEN-ID: 58350\n\nFrontend Developer (Web, App, Flutter) (w/m/d)\n\nab sofort und in Vollzeit bevorzugt in Bonn oder Essen, alternativ bundesweit an einem unserer BWI Standorte.\n\nSorge gemeinsam mit uns für die digitale Zukunftsfähigkeit der Bundeswehr.\n\nAls primärer Digitalisierungspartner der Bundeswehr erbringen wir stabile, sichere und effiziente IT-Services im In- und Ausland,\n\nvom Grundbetrieb bis in den einsatznahen Bereich und tragen so zur kontinuierlichen Erhöhung der Führungs- und Einsatzfähigkeit\n\nder Bundeswehr bei. Mit über 7.000 Kolleg*innen betreiben und modernisieren wir eine der größten und komplexesten IT-\n\nInfrastrukturen in Deutschland. Wir suchen verantwortungsvolle IT-Spezialist*innen, die die Bundeswehr-IT aus Überzeugung in\n\nherausfordernden Digitalisierungsvorhaben weiterentwickeln und so einen Beitrag zur Sicherheit Deutschlands leisten wollen. \n\n​Das Competence Center Application Lifecycle Management ist der Application Provider im Chief Information Office (CIO). Wir stellen\n\ndie Anwendungen der Corporate IT zur optimalen Nutzung für unsere Kollegen:innen bereit und sichern den Betrieb ab. Wir\n\nverstehen uns als DevOps Organisation in der wir unsere agile Kultur mit Leadership pflegen und weiterentwickeln.\n\nLet's be Agile ist unser Motto! Wir freuen uns auf Dich.\n\nIhre Aufgaben:\n\nKonzeption und Frontend-Entwicklung mit Flutter im Clean-Code-Umfeld.•\nTest und Dokumentation von Anwendungen•\nGewährleistung des Zusammenspiels von Front- und Backend•\nPflege, Optimierung und der Support von bestehenden Anwendungen.•\nUnterstützung des Teams bei übergeordneten Themen wie Dokumentationen, Test- / Qualitätsmanagement und Anwender-\n\nSupport\n•\n\nAufbau und Pflege der Entwicklungsumgebung•\nIhr Profil:\n\nAbgeschlossene Ausbildung und/oder Studium der Informatik oder im Bereich der IT-Entwicklung•\n\n\n\nEinschlägige Praxis- bzw. Berufserfahrung in der Entwicklung und Betreuung von Webanwendungen•\nExpertise mit Technologien wie Javascript, HTML, CSS oder Kotlin, Java und Swift•\nFundiertes Verständnis für UI-Design sowie User Experience•\nVertrautheit mit agilen Entwicklungsprozessen und -methodiken •\nHohes Interesse in einer IT-Landschaft mit sehr hohen IT-Sicherheitsstandards zu arbeiten•\nErste praktische Erfahrung mit Flutter wäre ein Vorteil•\n\nWir bieten:\n\nAbwechslungsreiche und gesellschaftlich relevante Aufgaben, wodurch wir die IT-Sicherheit und Zukunftsfähigkeit Deutschlands\n\ngewährleisten\n•\n\nMobiles Arbeiten, alternativ kann alternierende oder heimbasierte Telearbeit mit Ausstattung des Heimarbeitsplatzes beantragt\n\nwerden\n•\n\nEine marktgerechte Vergütung, einen sicheren Arbeitsplatz sowie eine prämierte und arbeitgeberfinanzierte betriebliche\n\nAltersvorsorge\n•\n\n30 Tagen Jahresurlaub mit Option auf individuelle Anpassungen•\nViel Flexibilität, um Beruf und Privatleben in Einklang zu bringen•\nEin individuelles Weiterbildungsbudget sowie einen kostenfreien Zugriff auf LinkedIn Learning und die Angebote der BWI-\n\nAcademy\n•\n\nEin modernes Notebook (HP EliteBook) und ein High-End Smartphone (Samsung oder Apple) sowie weiteres IT Equipment zur\n\nEinrichtung Ihres Arbeitsplatzes\n•\n\nFragen?\n\nNehmen Sie Kontakt mit unserem Recruitingteam auf.\n\nMerin Arathil\n\nRecruiter\n\nSchreiben Sie uns unter bewerbung@bwi.de oder rufen Sie an +49 (0)2225 988 5000.\n\nmailto:bewerbung@bwi.de\ntel:+49022259885000\n\n", "file": "job_description.pdf", "skills": {"Job Title": "Frontend Developer", "IT Skills": "UI/UX design, Wireframing, User story development, Development with HTML5, CSS3, JavaScript, UI design software (InVision, UXPin, Balsamiq, Framer.js, Quartz Composer), Advanced JavaScript libraries and frameworks (Angular, React), Source control tools, Unit test development", "Soft Skills": "Creativity, Collaboration, Problem-solving, Communication, Usability design, Presentation"}}
