{
  "Technische Fragen": [
    {
      "Frage": "Was sind die wichtigsten Unterschiede zwischen GeoJSON und GeoTIFF als Format für die Speicherung von Geo-Daten?",
      "Bewertungsmaßstab": "Die richtige Antwort muss die Verwendung von GeoJSON für die Beschreibung von geometrischen Objekten und die Verwendung von GeoTIFF für die Speicherung von Bildern und Tabellen erklären"
    },
    {
      "Frage": "Wie wird die Kommunikation zwischen den verschiedenen Komponenten eines Geo-Informationssystems (GIS) durchgeführt?",
      "Bewertungsmaßstab": "Die richtige Antwort muss die Verwendung von Standards wie Web Map Service (WMS) oder Web Feature Service (WFS) erklären"
    },
    {
      "Frage": "Was ist ein Geo-Informationssystem (GIS) und wie wird es in der Praxis verwendet?",
      "Bewertungsmaßstab": "Die richtige Antwort muss die Definition eines GIS und seine Anwendungsbereiche in der Landwirtschaft, Urbanistik und Umweltbahn erklären"
    },
    {
      "Frage": "Wie wird die Datenbank für ein Geo-Informationssystem (GIS) konfiguriert und gehandhabt?",
      "Bewertungsmaßstab": "Die richtige Antwort muss die Verwendung von Datenbank-Management-Systemen wie PostgreSQL oder MySQL erklären"
    }
  ],
  "Persönliche Eignung": [
    {
      "Frage": "Wie würdest du als Teammitglied im Kontext eines Geo-Informationssystems (GIS) deine Kommunikationsfähigkeiten unter Beweis stellen?",
      "Bewertungsmaßstab": "Die Antwort muss die Fähigkeit zu erklären, effektiv mit anderen Teammitgliedern zusammenzuarbeiten und Bedürfnisse zu kommunizieren"
    },
    {
      "Frage": "Wie würdest du als Junior-Entwickler im Bereich Geo-Informationssysteme (GIS) deine Problemlösungsfähigkeiten unter Beweis stellen?",
      "Bewertungsmaßstab": "Die Antwort muss die Fähigkeit zu erklären, komplexe Probleme zu analysieren und effektive Lösungen zu finden"
    },
    {
      "Frage": "Wie würdest du als Geo-Informationssystem-Entwickler deine Motivation und Leidenschaft für die Branche unter Beweis stellen?",
      "Bewertungsmaßstab": "Die Antwort muss die Fähigkeit zu erklären, die Bedeutung von Geo-Informationssystemen in verschiedenen Branchen zu erkennen und zu motivieren"
    },
    {
      "Frage": "Wie würdest du als Teammitglied im Kontext eines Geo-Informationssystems (GIS) deine Fähigkeiten und Erfahrungen unter Beweis stellen?",
      "Bewertungsmaßstab": "Die Antwort muss die Fähigkeit zu erklären, relevante Erfahrungen und Fähigkeiten zu nennen und zu erklären, wie diese für die Rolle als Geo-Informationssystem-Entwickler relevant sind"
    }
  ],
  "Codingaufgabe": [
    {
      "Aufgabe": "Implementieren Sie eine RESTful-API für die Speicherung und Abfrage von Punkten von Interesse (POI) in einer Datenbank. Die API sollte folgende Endpunkte haben: GET /pois, POST /pois, GET /pois/:id. Die Datenbank sollte ein JSON-Format haben. Die API sollte auch Benachrichtigungen an die Entwickler senden, wenn Daten in der Datenbank verändert werden. Sie können eine beliebige Programmiersprache und eine beliebige Datenbank verwenden.",
      "Bewertungsmaßstab": "Die Lösung sollte korrekt implementiert sein, die API sollte korrekt funktionieren und die Benachrichtigungen korrekt senden. Die Lösung sollte auch die Anforderungen der Aufgabe erfüllen."
    }
  ]
}